{
    "product title": "Best Choice Products Kids 12V Ride On Truck, Battery Powered Toy Car w/Spring Suspension, Remote Control, 3 Speeds, LED Lights, Bluetooth - Black",
    "overall rating": "4.5 out of 5",
    "total ratings": "16,045",
    "rating percentages": {
        "5": 77,
        "4": 11,
        "3": 4,
        "2": 2,
        "1": 6
    },
    "price": "239.99",
    "details": [
        "REALISTIC DRIVING ACTION: Give your kids a realistic behind-the-wheel experience with controls sized for small hands and a powerful 12V battery that runs up to 2 hours on a full charge",
        "PARENTAL REMOTE CONTROL: Join in the fun and take your child on a wild ride with full control over the truck's driving features",
        "INTERACTIVE FUNCTIONS: Four wheel drive with spring suspension pairs with working LED headlights for a realistic multi-terrain experience",
        "SAFETY IS PRIORITY: Includes plastic wheels, safety belts with locking doors, and a safe 3.7mph max speed for smooth cruising around the house",
        "BLUETOOTH SPEAKERS: Connect your kid's favorite devices to the built-in Bluetooth speakers and add a musical element to playtime; OVERALL DIMENSIONS: 46“(L) x 29.5“(W) x 31“(H); WEIGHT CAPACITY: 128 lbs."
    ],
    "best seller rank": [
        "15,042 in Toys & Games (See Top 100 in Toys & Games)",
        "11 in Kids' Electric Vehicles"
    ],
    "positives": [
        "If I could leave a higher star rating I totally would! I seen some reviews about the durability of the car but I believe they may have had some difficulties putting it together because I tell you right now it’s extremely durable! My daughter lovessss it and we took it around the neighborhood, down steep hills, up hills, and even down stairs!!! Didn’t have any issues and at one point she wanted to run instead of being in the car and asked me to get in and I totally did! And I WAS ABLE TO FIT IN THERE AND GO ALL AROUND THE BLOCK! Tell me that’s not durable! It wasn’t hard to put together either took my husband and I at most 20mins, included the battery, majority of the bolts were already placed where they needed to be, the Bluetooth wasn’t at all difficult to connect, the speaker works amazing honestly so much louder than we expected, the controller was easy to connect and we have no difficulties controlling the car with the controller either, and we totally understandable why it came in two boxes! TOTALLY WORTH EVERY PENNY!! Very happy!!!!\n\nGood looking jeep, headlights work, starter sound and horn are great. Perfect size for 3-year old. We customized it with a front license plate and a sticker of his favorite cartoon character. Plenty of room on rear to customize with more stickers.Battery life is better than expected. We have been careful to not overcharge (per instructions) and it ran about 2 hours, with battery life to spare. Runs good on grass, pavement, dirt.Remote control is a great feature, especially the \"P\" (for adult to override child's controls and STOP the car in it's tracks).Took about 45 minutes to assemble and the battery hookup/charger takes a bit of finger-muscle power to undo each time. Overall, a really good product that is delighting the 3-year old.A good purchase!\n\nBirthday present for our two year old grand daughter. Papa and Grammy have a red truck she loves to sit and “ drive” and also a Jeep. This toy Jeep makes her so happy! She can drive it herself but Dad or Mom also have controls for safety. Our son remarked, “it’s crazy that I’m teaching my two year old daughter to drive!” So much family fun. She takes the family pup as her shotgun passenger.\n\nWe bought this Jeep for our 2 year old daughter as a gift from “Santa”. It arrived very quickly and all boxes were in tact. It came in two separate big boxes. Putting it together was very easy compared to other kids toys that we have bought in the past. The Jeep comes with a remote control for the younger kids and it drives great on all surfaces! The battery life is terrific! Our Daughter LOVES IT!\n\nI am so excited waiting for my grandson to find his new Jeep under (beside LOL) Christmas tree. I really like it! Assembly was fairly straight forward. Everything works perfectly. I gave 4 stars for battery due to no track record yet. I also gave 4 stars for ease of assembly due to drawing on steering assembly not clearly defined. Remote, Bluetooth, volt meter, lights, etc. all work perfect.  I added vinyl graphics that really made the Jeep pop. I love it!\n\nI have a five year old on the smaller side and it fits her perfectly. Definitely a one seater. She loves the speed…any faster it would make me nervous. She’ll probably get 1-2 years out of it. Would recommend for 3-5 years of age.\n\nHave this to our 2 year old for Christmas. He loves it! Will not leave it alone.Holds a charge very well and fully charged in no time!\n\nIf  you have a toddler, this is THE gift to give! Easy to use and we especially love the feature that only allows us to control the car.\n\nmy son loved it although he’s still baby like a year old, he’s already riding it with our guidance. Remote controller was a big help too.\n\nAwesome product went together very easily instructions very clear to follow Grandson loves it. Having a parent remote is awesome. Meets all of my expectations.\n\nCame today, took my husband 30 minutes to put together. My 3 year old loves it. It does great in the yard. And goes pretty fast.\n\nWe gave this to our grandson for Christmas and WOW!!!  He loved it right away and so did his parents!  Lots of safety features and good for kids 18 months and up.\n\nEasy assembly. Lots of features.\n\nMuy recomendable. La duracion de la bateria es buena y tienes el control del juguete con el mando si tu niño no sabe manejarlo. Tiene radio, puede reproducir musica con tu telefono, le funcionan las luces, el pito. Esta acorde con el precio.\n\nI bought this for my granddaughter for Christmas. She absolutely loves it.! Relatively simple to assemble. Battery lasts about two hours.\n\nBattery life unknown. To early to tell\n\nI gave it as a gift and never saw it or had anything to do with it other than order it.\n\nVery Happy all around. Almost as happy as the person who received it for Christmas!\n\nGreat product fast delivery Great price\n\nThe media could not be loaded.\n                \n\n\n\n He is so happy it is now 3 o’clock and he did not have anything to eat from morning. He don’t want to get off no complain no problem it is good thank you.\n\nMy four year old granddaughter was over the moon!  It’s more advanced than the smaller model but this one she will use for years.  It does move quickly and she needs to practice steering and braking!\n\nWe gave this to my son for his 2nd birthday. Gone out a handful of times in the last month and so far it has been fantastic.Assembly was easier than expected.Quality is higher than expected.Value is fantastic given the features, price point, and quality.The only critiques I have (that I feel are more minor than they may sound) have to do with the remote. My kid is learning to drive and cannot be trusted – so the ability to override his movements was a key selling point.- It’s the only part that “feels” cheap, although it has worked well so far.- There is no ability to disable control from the jeep while still allowing control from the remote. You can press the “P” button to disable the jeep, but then you cannot move it with the remote either. Once you hit “P” again to enable the jeep – all controls are enabled (remote AND manual controls). I wish “P” only disabled manual control but kept remote control active. This wouldn’t be as big of a concern if it wasn’t for the next two points.- There is a small delay between pressing a button on the remote and the car responding, especially when it comes to stopping – first there is the delay between pressing the command and the jeep responding, then there is the delay between the jeep responding and it actually stopping (hard plastic wheels on concrete take a few feet to stop especially if you are going downhill at all).- The remote has the ability to choose between three speed settings, but the manual control (pressing the gas pedal) is always enabled at full speed. Wish the remote speed setting controlled the max speed for manual operation as well.- TIP/TRICK: You can disable the gas pedal in the car by unplugging the connection under the hood that attaches to the back of the shifter. This will allow your kid to steer while you control forward/backward movement – instead of having to rely on being quick enough to override them before they ram into a car or bolt out into the street etc.As I mentioned – this all sounds like a bigger issue than it is. If you stay close to your kid, be careful about where you are letting them drive and are ready to override them quickly, you’ll be fine.Overall, the remote could be improved slightly but I am very happy overall with this Jeep (and so is my kid!).Edit summer 2023: Still use this thing nearly every day. It’s in great shape and my kid is still totally obsessed!\n\nThe media could not be loaded.\n                \n\n\n\n If you're looking to buy a car for your child, this is the one. I have been using this for a little more than a month and it's still working very well. There have been times it slowed down but just charge it up for a little while and it should be good to go. My favorite thing about the car is the remote. You can move the car with a single button. You can also stop the car immediately if you need to. There is only one seat but you can fit another in if theyre small enough. The building process was pretty quick too. There was a bit of confusion while reading the instructions but we ended up figuring it out. Overall, a very good buy!\n\nOne of the best purchases for my kid he rode this thing forever! We did have to replace the battery once but that was after 2 years. Just replaced it again in 2022. And passed it down to the next kid!\n\nFirst, the good.  My nephew is 1.5 years old, so well under the 3 years recommended, and he lives in the country where it's hilly- so the remote control was critical both because he's young to operate it and don't want him driving down any banks!  It's not recommended to run in dirt, but it seems to do fine.  The spring suspension is pretty crude, better than nothing over bumps though.  Also, everyone loves it!  The kid was so excited, and loves riding around in it even though you need to drive him around with the remote.The bad- I can see how if you were utterly lacking any sort of mechanical inclination that there could be problems.  I noted the following potential issues:- The rear wheels are made from two halves glued together.  On one wheel, the halves weren't aligned that great but gave it a little slap and it went on the axle anyway.- Part E \"frame\" piece on the right side has the screw hole in the wrong side from the diagram, perhaps not obvious to some people.- The tail light wires on mine ran right under those same frame pieces, so I bent those wires out of the way before inserting the frame pieces to avoid breaking the wires (I saw a 1 star review where the tail lights didn't work, I'm guessing they weren't careful about this).- The motor wires hang from the undercarriage, so if you drive through any vegetation (and let's face it, most of us are going to do that) there's the potential to catch and yank those wires out.  Tape them up out of the way during assembly.- The remote steering is pretty drastic.  There's no gentle steering with it.  Same with letting off the gas.The last thing, and which I think caused a very large amount of the 1 star reviews- it uses a lead acid battery.  These are great batteries if you keep them charged, don't overcharge them, don't run them flat, and don't let them sit ignored for months and months.  If you buy a lead acid battery at Christmas and let it sit until May, don't expect to be happy about its lack of performance.  If you put it on the charger and forget about it for days- bad news.  If you let junior ride the car until it quits, then forget to charge it, ride until it quits again- you're doing some damage.  They're cheap and they're reliable if you're nice to them, which is why this car doesn't cost a lot more.  So for the price I don't think it's fair to complain about the battery type.\n\nThis Jeep is the best power wheel ride on toy we have ever bought. It is so well put together the fact that u can control the Jeep with a remote forward backwards 3 speed setting on remote left right control and emergency brake u can stop it instantly it stops no rolling to a stop if u hit it if your child was about to get into harms way hit that stop button and it stops runs great on the road and surprisingly it runs great as well on grass and we have even ran it up and down decent step piles of mud this thing will take what ur child wants to drive it in. We love this amazing price for what u get battery last for about 1 1/2 to 2 hours but theirs also a amazing thing they did your battery is strapped into a spot under the hood on the right side a hole with drilled out holes to strap it down theirs also the same thing but empty on the left side for u to add on a second battery 12 v positive ran to positive 12 v and neg ran to beg it calls for 12 gauge wire if your interested in doing it to yours cause the batteries are cheap to buy it still takes only over night to charge but now our little guy rides it so long it he gets tired and wants to go in letterly it hasent died sense I added a second battery it’s simple to do theirs videos on YouTube under bcp Jeep second battery add on If interested. We love this toy I know it’s not recommended but I got in it one day 180 pounds and it did just fine even with me in it it’s very well made it has led headlights and park lights front and back and then this is our next add on every light u see on it front and back fog lamps other turn or park lights in front and back bumper have pre drilled out holes as well so u can later on add more led lights for cheap to it if u like.  Do your kid a favor and do yourself a favor cause I promise u u can drive it without a kid in it and u will find yourself now and then driving it having fun even when your child gets out lol buy this and enjoy!\n\nMy 3yo loves this thing. The first thing he wants to do when he gets home from preschool every day is ride this thing around until dinner. My observations:- The controls are really intuitive. With the exception of the radio, he mastered everything else very quickly.- He loves the working lights and doors that open and close.- He likes to use the radio but it doesn’t go loud enough and he can barely hear it over the sound of the car on full blast. He stops driving at quiet points in songs or when they change over.- This thing is a beast. I realize I could never claim a warranty on it, but my son brings this thing over all sorts of terrain and it is awesome. Grass, fill dirt, gravel large and small, uphill where the lawn got beat up. We have a gravel driveway and needed something that could do that. We found reviews that highly rated this thing very highly for grass and gravel and it didn’t disappoint.- The battery lasts about 30-45 minutes before we start seeing some slowdown. I keep telling my son it would be longer if he doesn’t use the lights and radio but he prefers to run them.- This isn’t as fast as other models, even at top speed. While we knew that going in, I do wish it went just a little bit faster for him.- We especially wanted a vehicle with a remote. We have a lot of woods with poison ivy and things around our property. The remote has been very handy though we rarely need it. I do wish it was designed in a way that you could easily put it in your pocket when you don’t need it and just grab it when they get close to something you’re worried about.- When it’s done charging, make sure you don’t put the connectors back together until you are ready to drive it. The battery will very slowly drain once the system circuit is closed.Overall definitely worth it, especially if you have a lot of grass and gravel in your yard.\n\nWell my kids both love it (3 and 5).  I now have to get another one . . .  And my sister now has to get one for my nephew.  It is a great toy.  I did have some questions that I could not find definitive answers on this toy.  Now that i have used it I hope the below feedback will help.Does it work on grass?  Yes.  We live out in a farming area.  The kids drive it through short grass, over gravel, obviously over cement.  Would definitly drive in a mowed yard.The time of use after a full charge seems to be about 1 1/2 hours on average (does vary a bit).  You can tell when it starts getting low as it gets slower.  I would be interested to see if you can order another battery and install it to double the usable time.The controller is a lot of fun, we strap the nephews in and drive em around.  There is a limit on the distance the remote is effective at.  If you are in a back yard you will be fine.  If your five year old daughter is driving through a big field and you decide to try to use the remote to take control it probably wont work.It can of course get stuck on a hill or rocks, or mud or very wet grass - the tires are plastic after all, not rubber.  but overall it is pretty impressive how it gets around through various terrains.Putting it together is suprisingly easy.  I made sure I had a mechanically minded friend over - turned out that was not necessary.  I've put together dollhouses far more complicated then this.  Took 2 people about 25 minutes.  You do then need to charge it for 12 hours before first use, so keep that in mind if it is a gift.As far as the radio goes - it works.  Its a bit complicated as it seems to go through all the channels available every time you start it up and then preset based on available channels.  I find it complicated - my 5 year old therefore does not use it.  Says it came with preset songs but we havent found any.  And though it looks like there is a port for a phone - well my five year old doesn't have a phone and there is no way I'm sticking my i phone on that jeep and letting them take it out into the field.  So the \"sound system\" could maybe use some work.Otherwise great product.  Wish they were around when I was a kid.\n\nI was pleased with the quality of the Jeep. The price was great. The jeep rides nice. It definitely is not big enough for 2 children comfortably. My grandson is 2 and there is very little room beside him when in the jeep.\n\nPrice: Relatively betterQuality: Big and sturdy look. Weight limit is as specified. My daughter 40lb and my son 21lb fit good without compromising the speed and power of the motor.Battery charged for 5-6 hours stands for 3 hrs of casual ride on a flat grass surface. (May last even longer but I normally charge every 4th day).Operation is overall cool and simulates actual car driving to a great extentMy Favorite👌: Bluetooth, Pull handle, Flashlight, easy gear lever, remote controlWish it had: Rubber tyres or rubber lining instead of plastic, Speed control (remote has but not self driving) and a way to stop gradually. Currently only option to stop is to take the leg off the pedal and it stops with jerk. Would also appreciate more lengthier seat belt that's adjustable.Anyway as far as I know all other brands also have most of these issues. So no regrets\n\nThis has been great for our 3 and 1 year olds to share.  We had previously bought a Peg Perego Case III tractor that my oldest son loves (and he has been so hard on it and it has lasted so well!  If you need a one-seater, I highly recommend it!), so we figured we needed to get another vehicle for our younger son to ride along as the tractor was only a one-seater.First off, this truck is more of a Cadillac or Rolls Royce compared to the Case III being more of a Porche.  The Case has 2 speeds and will really get up and go and can take tighter turns, but as far as features that's where it stops.1. This truck has great suspension, but it does not go very fast and the turning radius isn't very tight.2. A radio with 1. pre-programmed mp3's (about 5 or so), 2. a USB plug for your own music to plug in, 3. it picks up local radio stations too! And it has volume controls as well.3. The seat and included seatbelt will fit 2 small children (one is about 30 lbs, the other about 25 lbs).4. The headlights and tail lights work!5. There is a second cutout under the hood if you would like to beef up the stereo and add a second speaker (it only comes with one speaker).6. There is also considerable space under the hood if you want to add any weight.  Sudden reverse to forward movements can cause the truck to want to pop a wheelie since the seat is near the rear moving the center of gravity where the kids are sitting.7. The \"mirrors\" on the doors are adjustable and the steering wheel has a working horn button and radio station change button.8.  The parent remote is a great feature (be careful not to push the parking break button and not remember to turn it back off or the kids can't drive the truck on their own).  The remote has a pretty short range though so you pretty much have to follow them around with it to keep the signal.  But it does seem to have more than one speed when using the remote.  I haven't tested it yet to see if setting the speed on the remote carries over when they they go back to driving themselves.9.  The battery life I would say is pretty short compared to the Case.  It has to be charged every night after a day of play while the Case can go a couple days on a charge.All in all it's been great so far in the few weeks we've had it.  The kids will drive around outside for hours and just get such a kick out of it!\n\nBuilt very well and drives smooth. Kids love it, I would buy it again.\n\nThe media could not be loaded.\n                \n\n\n\n Review from 1st purchase back in 2020...Loved the truck, but unfortunately there was a defect in turning the steering wheel. One minute it locked the next min it drove, but made loud clicking noises when turning right/left. I reached out to best choice products (which wasn't the best), they \"OFFERED\" to replace the jeep and I never received it and have been waiting since Nov 2020, it's now going on Feb 2021 and still no replacement. I emailed them multiple times and all I'd get was the same answer, but a different person emailing. \"You will receive in 7-10 business days,\" I swear I think I was conducting business with a darn robot. I WAS PISSED... I sent one last email asking them did they think this was a joke, it's like they were playing psychological games and it surely wasn't funny. This was my grandson's birthday gift in Nov 2020, and they seemed as though they didn't give a hoot. Almost like they were all sitting back laughing, and sending the same reoccurring emails over, and over, and over again. They would add a few additional words, of which gave me a bit of hope to just hold on a little longer, But guess what???... I got the last laugh! Amazon refunded me $280+ without me having to ship the powerwheel back, now they have to come out their pockets. I wonder who's mad now HAHAHAHAHA!!!!Moving on to today 5/2023...we purchased another one for our granddaughter's birthday. So-far-so-good! Hope I don't have to come back with any bad updates. I will say, the reason for repurchasing from this company again is because we were able to repair the issue with the 1st purchase. It is still operable to this very day.I do not want to tarnish this company's reputation because of one unfortunate incident, so the least I could do was give a great review for the new purchase, and a current update on the 1st powerwheel.Thank You Best Choice Products!🙂\n\nWe purchased this red Jeep for our grandson’s 4th birthday and he was thrilled! I’ll list my pros, cons and notes below. For reference, he weighs 47lbs and is the normal height for a 4 year old.PROS: **The parental remote works great. I really like that it doesn’t have too many buttons so in an emergency, it wouldn’t be confusing. **The Jeep isn’t too fast or powerful as to be unsafe, but it is powerful enough to be fun and knock down the croquet wickets in its path. (What do you expect? He’s four.) **The driver controls aren’t over complicated. He was able to get right in it and after just a minute of looking, drive away. **It is very sturdy. At one point, my grandson’s little friend stood on the back bumper and they drove around. He probably weighs 40 pounds. **The wheels are plastic rather than foam which is nice for water, mud or snow etc. **The Jeep looks and sounds really cool assembled. **It isn’t too heavy. It was easy to lift into the back of my Jeep Grand Cherokee to transport to the park where we gave it to him.CONS: **The assembly was a little more complicated than I thought it would be (but not impossible). **The hubcaps don’t seem to attach very well to the wheels. I ended up taking them off and will find a way to attach them more permanently. **There isn’t a lot of legroom. Although this Jeep has a pretty high weight limit, if your child has really long legs, they might have a problem with legroom.NOTES: **Be sure to read the instructions on the first charge. They are specific on the amount of time. **When you first install the batteries in the parental remote, they have step by step instructions on how to pair it with the Jeep.We researched children’s electric vehicles on various independent consumer websites and did price comparisons before choosing this particular one. I was happy when I went to their website and saw they also sold through Amazon.I gave it five stars because the pros far outweighed the cons for me.\n\nEasy to assemble.  Remote works beautifully and as expected.  Our toddler grandson is absolutely in love with this jeep.  He kept repeating the words \"nice, awesome\" while he was navigating around the yard!\n\nWe purchased this in Jan 2020.  We still use it almost every day.  The remote is a god send.  Only issue we've had is our ground is super bumpy and about 2 years ago the front suspension wore through the screws.  Just a quick weld job and some wide washers and we've had no problems since.  Just replaced the battery this year with a larger one with 2x the capacity.  We take it on walks so the parking break and speed control features are perfect.  If a car is coming we can either take over and put her into the grass or lock her out with the parking break.  Our daughter is almost too big to sit in it anymore so her little brother will be inheriting it.\n\nOur new car owner is just turning two years so we needed him to have a vehicle we could remotely operate.  But we couldn't ask for a more thoughtfully designed product (pretty green).Well, first we received the box of tires and he was extremely pleased just with that...the rest of his car came days later, and he still didn't realize it was going to move ever...he sat in the body (without tires) watching TV.  More days later, putting it together in our living room was a family affair; we got out his set of tools (his little red (plastic) hammer and screwdriver) and he handed out parts.  He couldn't believe what he saw when we turned it over for him once finished and started playing with the horn, remote, radio, MP3 player, the 'vroom, vroom' noise button.The radio is FM and seeks out channels efficiently; sounds great and is loud;  I suppose when we're on the road it could use that antenna a helpful reviewer suggested but it may be fine as it is.  Our guy signaled assumption of ownership by bringing out his blankets to put in his car...He'd sigh so happily it sounded a bit like a whoop!.  I have video of him first stepping on the gas...he's so surprised and everyone shouts as he heads for the couches....then backwards...luckily the vehicle has the handle on the back so we were able to lift the back to stop the strong tires from continuing to gain traction before our guy lifted his foot from the pedal.THEN he stole the remote so happily scaring us by pretending to know how to use it ...little shoulders lifted, decidedly aiming it, then running as someone ran to get it from him.The lights on this vehicle are bright in the front and pretty red shinning in the back.  The MP3 we attached played his favorite music.  The dashboard lit up the MPH, another big gauge and a few items like power and radio.  It’s possible he feels this is on par with a finely tuned BMW...his first car.  I'll submit pictures.\n\nI bought this for my daughter since she loves nothing more than going to the trails in daddy's real Jeep and figured she could ride in the yard in days we can't go to the trails. When the vehicle showed up i followed the instructions and put it together and charged it over night. This thing is really straight forward to assemble a long as you follow the instructions. The next day my daughter was beside herself with excitement as I wheeled it into the yard for her to pay with.. I flipped the power switch, the lights flashed once... then nothing. I called customer support and was walked through what to check and no leads were loose or anything and absolutely nothing happened with anything we tried.. I was more than a little mad until the service agent told me they were going to send me another one and they'd have it on the truck that day to go out. I got a tracking number by email an hour or two later and sure as cash be, it was on the way. When it arrived I again assembled by the instructions, charged over night and took it into the yard the next morning.  To my surprise this one started right up, radio worked(and its loud and clear)  and everything worked as expected.  The remote is kinda cheap feeling but it does what it is supposed to do.  My little one loves her Jeep and I have fun remotely driving it around with her on it. The agent told me to keep the dead one for spare parts so I didn't have to wrestle with it, it's just sitting in storage until I need parts or want to put a gas motor in it so I can have a mini crawler or something.  Overall I am extremely happy with the product and the customer support and recommend it\n\nProduct arrived fast and worked as described. Had an issue with the battery and the manufacturer sent a new replacement and additional items. Great service!\n\nI’m going to give this car 5 stars despite the car flipping on the first drive because I feel like any of these cars could flip under the right circumstances. It scared the living crap out of me. My 6 year old and 2 year old had both managed to fit in the seat. My 6 year old was driving and accidently ran over the base of our portable basketball hoop which is several inches high. The car flipped completely over. They ended up with bottom of the car belly up. The boys were surprisingly fine. If you get this car, just be aware of that issue. It completely rolled. Since then, my son had been careful not to run over things that could make the car flip.In terms of the car itself, I struggled over which one to buy. I wanted a seat big enough to fit 2 kids but also have a remote. There was only one car available that had both which is not this one. Looking at all of the recent reviews, I noted in that other brand there were far more 1 Star recent reviews than anything else which made me nervous so I didn’t go with them. I went with this brand instead and glad I did. It is not made to fit 2 kids which is the only thing I dislike about the car. Set up was super easy and took me no time at all. My only complaint was one of the holes weren’t lined up perfectly and it took some muscle power to get the screw thru all 4 holes. This was the back axle. Only one side the hole was messed up ever so slightly.Once I got it up and running ... the car has been great. The remote works perfectly. My 2 year old hasn’t mastered the art of steering so on occasion he needs help not running into things like parked cars. The remote is seriously a life saver. He is able to hold and keep the pedal down to drive it on his own. We have had no issues at all with its performance granted we are on day 1. Our 2 year old has been in the car for hours so far today and it still hasn’t run out of battery.If anything changes, I will update. So far, I love this car and more importantly my 2 year old does as this was his birthday present.\n\nExcellent services and faster delivery. Five stars\n\n",
        "I was comparing name brand ride on power toys, and this stood out for price and features. I was not worried about any assembly issues mentioned in other reviews, as I planned to strip the entire thing down for paint on arrival anyway. There are only a couple items to throw together out of the box and i was able to assemble and test it within 20 minutes of opening the box to verify it was ready to tear down. I was able to disassemble over an hour for paint prep, which will be different for everyone depending on the desired scheme. I needed to build doors, the ones that came with it functioned great, I just needed a spot for the logo to go. I also installed actual mirrors in place of the stickers, because why not. Fun project overall. I've taken it for a few test drives after final assembly using the remote and everything functions great so far. The Bluetooth functionality is easy to use for audio, just be prepared for the heavily accented voice prompts. Power seems more than sufficient. It will now be waiting for Christmas to unveil to the kids, so I'll come back and update with any additional observations once it has been fully broken it in.\n\nWorks great my kids love it\n\nWe bought the same Jeep 2 years ago and haven’t had any issues with it so when it was time to get a ride on toy for our younger son it was a no brainer to get the same one. Now we have a red one for older brother and a grey one for younger brother.\n\n2 years old and still going strong! Battery lasts longer than I expected. Plenty of power for 2 small children and definitely climbs thru dirt and longer grass and even the forested area around the house!\n\nAlthough the box the jeep was shipped in was slightly damaged with a hole in the side, everything was good inside.  Some people have said the instructions needed work but what I received were fairly good and easy to follow.  The only thing I would change would be the assembly order of the back axle.  The instructions say to insert it into the axle holder first, then slide the drive motors on.  However there isn't enough length on the motor wires to allow this.  It needs to be inserted into one of the drive motors first, then the axle holder, then the other drive motor.  The only other thing was that I ended up with two small plastic clips that weren't identified in the instructions and it's not obvious where they go, so they are \"left over parts\" and unnecessary best I can tell.  I charged the battery for the recommended 8 - 12 hours.  The lights, horn, and radio all work as does the remote.  My 2 year old grandson REALLY loved riding around in it as we drove with the remote.  We had it on packed gravel as well as grass and on gentle hills (nothing very steep) and it ran very well.  It will even drive over small obstacles, probably 4\" or less in height given it's already moving.  We ran it for probably 30 minutes solid without stopping much and it never showed signs of slowing down or weakening.  I'm very happy with it and would highly recommend it.2021 update ...  after using the jeep for a few months, the original battery began to get weak and would only run the jeep for about 15 minutes or so.  And going up a slight grade was almost impossible.  In the attached picture you'll see I've replaced the original 12v 7AH battery with a 12v 15AH version. And I added an additional identical battery wired in parallel.  Now the jeep is over a year old and will run for more than an hour without showing signs of slowing down.  And hills are no longer a problem.\n\nReceived the car. Was pretty easy to assemble. Unfortunately I charged the battery for the required time and it did not work.I reached out to customer service and they responded very fast and offered a replacement. Now we have installed replacement and car works great. My daughter loves it.\n\nThe media could not be loaded.\n                \n\n\n\n For a minute I almost did not buy this toy. Due to the many reviews. Some seemed pretty bad. I went ahead and still bought it. No regrets! This thing is a champ and the daughter loves it. Battery is decent as well. About 3 hours use on grass!Things I like:-looks-build- this is actually well built. I can't honestly see how people are breaking the axles. They are made of medal and very sturdy I cam see electronics on this going bad before anything but not the axles. See the pictures of ot for yourself!-features:-parent remote- paired easily after reading the provided instructions, never unpaired, and has a decent range of the backyard. Works good. Sets speed. E brake, and helps since my 2 year old can't really drive it yet.- the radio- works great. It has FM, USB, aux core, and micro sd slot. I used the micro sd slot, loaded some tunes and put her in. Sounds good. The radio also tells you the voltage of the baterry. A 12v batter will be dying out at about 10 aph.The lights- lights are nice and bright. Even the brake lights in the rear light up but they do not light up when braking.- seat belt and doors- doors are magnetic and close and open. The seatbelts is a nice feature and easy to hook in. There is also a place for a harness.- forward and backward gears.- hood latchesThings that could improve--The charger is ok. It could be better. I personally will eventually use a different type of charger.Battery- is good. It lasted 3 hours running non stop on grass and with radio on. The vehicle has a second bay with holes for the battery holder.it comes with a 12v 5aph battery. Batteries and bulbs store sells the battery or upgrade. I bought a 12v  aph  to upgrade the battery and run parallel 12 v batteries. Should last a lot longer. Especially since we use on grass yard.- would be nice if they had a 2 seater. But this is niceOverall. Great toy. I highly recommend\n\nWe LOVE this car! It runs great on grass, but we did wind up having an issue with either the batter OR the charging cable (we aren’t sure which one since the light on the charger stopped glowing.. but we had no way to test it) and a quick message (through Amazon) to their customer service and we had a replacement on the way!Highly recommend\n\nBought this toy car last year for my son’s Christmas present. It great toy car for a toddler. It run good and battery last for more than two days until last week Friday April 22 when I was trying to park the car using the remote control and it just started accelerated in reverse and the back tires are just keep spinning. Had to turn it off on the car power button cause it won’t stop using the remote control. Right after it happened I immediately contact Best Choice Product costumer service in their website. Talked to Jade their costumer service awesome and helpful guy. He walked me through to trouble shoot the toy car. But trouble shooting the car didn’t help so he ask their manager if they can still send us a replacement toy car because the car is out of warranty and we didn’t paid for any warranty. Waited for a little bit to find out that day if we get a new replacement and YES they’re sending us a replacement for a new toy car and We don’t have to return the defective toy which was awesome cause we ain’t paying for that to return. Lol 😂Anyways we got the new toy car replacement today one week after I talked to their costumer service.\n\nThe media could not be loaded.\n                \n\n\n\n These are great! Arrived on time. My children love them! 5 stars all the way. The only thing I would recommend is having an extra person when it comes to the front axel ( unless you have very strong hands) this step requires you to push on a spring and put on a bolt at he same time. My hands hurt for days and the manual said one person assembly. Other than that assembly was very fast and the batteries came charged. It say’s recommended age goes up to 8 but if your child is on the taller side I wouldn’t go with this. My 6 year old daughters knees hit the dash although she still loves it. Overall great product for the price and will recommend!\n\nThe media could not be loaded.\n                \n\n\n\n Purchased as a birthday gift for a 2 yo. After reading a lot of reviews and watching what little videos they have for this product I decided on this one because of its ability to drive up inclines and uneven terrain. Plus the assembly video was the simplest out of all the similar jeeps out there. Battery life is better than expected and our son loves his new Jeep. It’s even has the power to carry 2 kiddos up a hill. Has 3 settings and I feel the lowest setting is fast enough for driving around the neighborhood. My little one doesn’t know how to steer or use the pedals yet so the remote control is a must to have. Parents enjoy playing with the jeep as much as the kids love cruising around in it.Tips: be cautious with your battery charging time. The manual will tell you not to leave it charging over 12 hours, I set my phone alarm as a reminder. And to not let the battery go completely dead as they only last a few hours.Also, the Jeep arrives in two huge boxes. DO NOT WORRY IF THEY DON’T ARRIVE AT THE SAME TIME. A lot of reviews complained that they were missing tires or they only received tires when they should have waited for the 2nd box. We didn’t assemble/open ours until the 2nd box arrived to make sure we didn’t break or lose any pieces.Totally worth the money for all the smiles\n\nThe media could not be loaded.\n                \n\n\n\n Update: still works like a champ! Battery is still strong and had absolutely no problems with this jeep!Arrived in 2 boxes, took about an hour to assemble. Instructions were easy to follow. Battery stays charged for much longer than I expected ! It's pretty hilly where they live and this jeep has no problem going up and down. Has 2 speeds, the remote works great, and we have no complaints! It's perfect! She is 2.5 and loves it!I DEFINITELY recommend this for any parent! Lots of fun!Oh and the Bluetooth works great ! She was blasting Bluey !!\n\nJeep with remote is a game changer.  Purchased for our 3 year old grandaughter. Was a little nervous not knowing if she could drive it. She certainly can about 75% of the time. When she stops paying attention or needs help, the remote comes to the rescue. Highly recommend this item.\n\nBought 3 of these. Assembly was easy enough with the first one taking about 90 minutes, but the other 2 taking about 30 minutes each. The remote has a range of about 60 feet. After a full charge the battery holds up well. One charge handles 4 or 5 periods of 30 minutes each. Only issue was with one headlight on one unit having faulty wiring, but that was easy to diagnose and repair.  NOTE: If you use these on asphalt or concrete surfaces the noise level is so high the child will have difficulty hearing you trying to get their attention.  Largest child using one is 48 inches tall and 45 pounds. Getting close to a tight fit, but the motor handles the weigh with no problem.  The smallest child is 36 inches tall and can easily operate the unit.Photo of tire is after about 8 hours use on sidewalk and asphalt. Probably about 1/4 of the tread has worn away.Update: June 2023.  After 18 months it runs without issues and the wheels shown haven’t not worn and excessive amount. 90% of use on sidewalk and street surface. Spot weld on frame for rear suspension has broken on one side.\n\nThis is the bomb! My 18 month old grandaughter received this Jeep for Christmas. Right now, we are using the remote to drive her around the back yard. But after a few sessions, she is starting to grab the wheel and we are trying to teach her how the gas pedal works....but that skill set is a ways off. I purchased the 12ah batteries on a recommendation here on Amazon, but I haven't had to install them yet. We are worn out before the batteries run down! I'm sure I will do some upgrades on it when we see how she uses it, but I'll probably get stickers for it and decorate it for her for now. Lights don't seem to be an important feature for her right now. I have been entertained by all of the YouTube videos that show how to hop it up to get more speed, and I may do that down the road, but it isn't necessary now. Best gift she got at Christmas. It was definitely a hit. All her parents have to say is \"Want to go to Pop's house and ride your Jeep?\" and she lights up! We walk out the back door and she is trotting to my shop, ahead of us all. She knows right where it is and gets right in. Very happy with the purchase. Keep a spare set of AAA batteries for the remote in your pocket for a quick change if needed. That will minimize any interruption of the fun.\n\nPurchased this jeep for our granddaughter, and she loves it. It takes a little time to assemble but if you’re patient and follow the directions, it goes together very well. Would recommend this if you have a grandchild her child that’s looking for a neat little thing to ride around outside.\n\nI had a very nice experience with this seller, because the delivered even earlier than they supposed to do it. Since it was a present for our son’s birthday for us it was extremely important to get it in time! The car looks very nice with good quality details and packed good! I highly recommended it!\n\nThe media could not be loaded.\n                \n\n\n\n I bought this for my  year and a half daughter for Christmas and she loves it. Assembly didn’t take long maybe about 45 mins. There is  a YouTube video to help you if need be . My daughter loves to blow the horn and start the car up and go for rides. Overall the Jeep is a great buy with a few consCons:The lap seat belt doesn’t really keep my child secure even on the tightest setting as she can still wiggle out of it and stand up. I plan on fixing this by adding a six point harness that I bought off amazon.  It might be more secure for the child age that is recommend by the manufacturer?The remote control does a nice job controlling the Jeep when the toddler doesn’t interfere. my daughter tends to like to play with the shift knobs which controls if the Jeep goes forward or reverse.  If she presses the accelerator, depending on what position the shift knob is in that’s the direction the Jeep will go, there is no indication on the remote if the Jeep shift knob on the car is in forward or reverse. So if I’m using the remote to go forward and she puts the shift knob and reverse and touch the pedal she will go backwards even if I’m using the remote to go forward . The car controls overrides the remotes control.Maybe it’s a way to turn of the child control of the Jeep while the remote is in use?Reason I love the Jeep : I added some things to it. I added a extra battery for longer run time, halo lights controlled by a remote , Jeep emblems, another speaker under the hood, Bluetooth.  This thing is fully customizable depending on how creative you areI would definitely buy again.\n\nCan't complain.  My 2 year old and I have put this machine to the test.  It's ran through tall grass, up and down hills, and all over the countryside.  It may not be the fastest machine on the block, but it doesn't quit.  I have upgraded the stock 7AH battery to twin 12AH units as there's a precast 2nd battery housing in the passenger side engine bay, and I routed the radio antenna up through the windshield housing which greatly improved the radio reception.  However, if you do add a second battery, please make sure they're wired in parallel, as wiring them in series will produce 24V, and burn up either the motors or gearboxes in very short order.  On that note, while I was replacing the stock 18? 16?ga. wiring to the motors with 12ga. to ensure the most efficient power transmission, I split apart one of the gearboxes and was rather impressed.  While everything was of course plastic, it was all good reinforced nylon and the fit and finish in assembly seemed solid.  I would venture under normal operating conditions the failure mode of this machine will be the electronics under the hood.  The remote control seems great out to at least a couple hundred feet with direct line of sight and at least with my toddler quickly averted his poor steering choices.  When all else fails the \"P\" button on the remote kills all power to the driveline. Overall, this machine has seen dozens of hours of use in lots of different conditions, many of which it was probably not designed nor intended to endure, and has performed admirably.\n\nThis Jeeps cool right out the box.  It's bigger than I expected and well made.  The only issue I had was installing the rear axle into the motor frames.  The sub frame was not square so sliding the axle in required a hammer and some patience.  The remote paired with no problem.  I read reviews about the short run time on the original battery so I upgraded to dual batteries with higher amp hours.  I customized it by painting the frame and other accents, brighter leds and added fog lights, rock lights, light bars, a fairlead for a \"winch\", and stainless screws around the body and wheels to make it look more aggressive.  My daughter loves turning on the radio and taking this for a ride around the yard.\n\n"
    ],
    "neutrals": [
        "This ride on is simply the greatest in entertainment for our 3 year old grandson. He absolutely loves just going for a ride. 4 stars from me so far.Delivery - Arrived in two boxes. Boxes were in very good condition. I really like how they package everything using a minimal amount of styrofoam! Many parts come wrapped in plastic bags to protect everything, at least they are recyclable. A few squares of styrofoam protect the heaviest part, the main body, from drops in shipping. The rest of the packing is cardboard. Kudos to Best Choice for designing the packing to be readily recyclable!I saw a review where parts were rusty right out of the box, I did not experience anything like that. Everything was in perfect condition from the box.Assembly - Not complicated at all, instruction booklet is probably one of the easiest I have to read. What parts you need are clearly labeled, there are only 3 different screws included, and the instructions tell you to use the screws required by the number of them included in the box!Assembly tips -Lay the body upside down on a towel or blanket, you dont want to scratch it up the first day.Don't use a power screwdriver. NO. One of the things I took a star off for is the screws you have to use just drive into plastic. I wish there was some type of reinforcement in the areas you use the screws, its just plastic. Thick plastic, but plastic. Blasting those screws with a any kind of power driver will strip them out, guaranteed. Use a good old fashioned manual screwdriver and dont go ham on the screws. Snug them down and leave it alone.When assembling the steering rack, DO NOT cut off the plastic the front suspension springs are shrink wrapped in. Install them as is, otherwise you will notice you can't get the two bolts on that secure the assembly together without having to compress the spring.You are given 2 plastic 13mm hand sockets, if you have a real 13mm socket or wrench, the better. The 13mm nuts are locknuts, that is they have a plastic disc in the nut that helps prevent the nut from backing off during use. Don't use loctite on the nuts, just replace the nut with a new lock nut if it backs off/fails.You have an opportunity to \"upgrade\" your assembly by having some high quality silicone grease, also known as \"dielectric grease\". I use 3M, as seen in the picture. You can order it on Amazon, or go to your local parts store and get little foil packs of it. It is a plastic safe lubricant that also protects the electrical connectors from water and corrosion.Do not use petroleum or \"oil\" based grease or sprays, you will cause damage to the plastics. Silicone only.I used silicone grease on the rear axle, everywhere it passed through metal. The axle in general is not rotating as the plastic wheels rotate on the axle, but if you have to disassemble the axle in the future, it'll come apart much easier.Use silicone grease on the axle where the plastic wheels sit. The plastic wheel hub rotates on the axle and some silicone grease will go a long way in preventing premature wear to the plastic wheel hubs. The wheels are held on with the 13mm locknuts, easy to remove every so often to apply a new layer of silicone grease.While I had the unit upside down, in the picture, you will see white electrical connectors. I opened those connectors, gave them a smear of silicone grease, and snapped them back together. They are in an area I figured water, dirt, grass clippings, etc etc would be kicked up and the silicone grease will help protect the connection from oxidation and corrosion, preventing issues down the road.When assembling the front steering rack, be sure to use silicone grease everywhere you have metal to metal contact, and again, where the front wheels rotate on the metal shaft. Don't go ham on the steering rack spring locknuts!! Just snug them down. Over tightening them will most likely cause excessive wear and tear on the steering motor for remote control operation due to excessive tension in the assembly.The front bumper can be tricky to install, if you are trying to line up every screw hole first. Dont try to line up every screw hole first. Pick one side, far left or right. Press and mash the bumper to get the first 2 screw holes aligned, and manually drive them home. Then all you have to do is work every screw hole, one at a time across the bumper, pressing and mashing the bumper as you go, until you you have them all in place.Once you flip the unit over, everything else pretty much snaps into place with only a couple screw for the rear light bar (both sides the screw goes in left to right, not center to center) and a couple screws to hold the seat down.Under the hood (battery compartment) -There are a number of wires under the hood, quite a few actually. Has to be expected considering how many features this ride has, with all the bells and whistles. Wire management is rather disappointing. In general the wiring harness has points where shrink wrap and tie downs are used, but there's just a few wires kinda floating around, ready to get ripped out if you are not paying attention removing the battery, or grabbing the remote if that's where you keep it. As part of my final assembly, I added a few loose \"zip ties\" to better secure the rogue wires in question.I find the battery hold down not very convenient, considering we have to remove the battery to charge it. We are storing the car, with a cover, on our deck but its not practical to have a cord running to it to charge. I plan on replacing the phillips head screws with wing nuts to ease the battery removal. The battery has a quick disconnect terminal that you plug the charger into when recharging the battery.The whole power system is well built, with terminals protected by hot melt glue or shrink wrap, and fuse links to protect from excessive current draw or a short circuit. There is actually plenty of room to add another 12V battery if you desire, just to quickly switch, or to wire in parallel if you know how to do so, for longer run time.Operation -The remote requires 2 AAA batteries. You have to pair the remote to the vehicle. You need to long press the \"Frequency key\" button of the remote until lights blink on the remote, THEN turn on the car power button. The remote lights stop blinking and it should be paired. We had some issues with the remote consistently remaining paired to the car, and you have to remove the batteries from the remote, then start over. The problem with that is the remote battery cover has a small screw to keep it closed, and without the screw it wants to flip open even though there is a plastic detent tab on the cover.Hitting the power button on the car is great. Everything lights up, you get an engine start sound and it \"revs\" a few times. The dash comes alive with various lights like a real instrument cluster, and you have working lights around the outside of the vehicle.The steering wheel is solid, and has working horn buttons. I'll admit it does take a wee bit of effort to turn the steering wheel, as you need to overcome the resistance of the steering motor for remote control plus the general resistance of the linkage of the steering rack. It's not anything a toddler can't muster, just requires effort. The steering wheel gear passes through the remote control steering motor, if/in the event the steering control motor fails the car is still 100 percent usable by manual steering. The shifter allows the vehicle to go forward or back.Once the remote is paired, you have complete control of the vehicle. The remote is paired to the car via bluetooth, and the range is actually impressive. We probably had the car some 50 to 60 feet away with no issues with control. With the remote you have stepping left/right control. Stepping means you have to tap the left right buttons to point where you want to go, the car will not go to center automatically.  The remote also regulates the speed, you have 3 steps you can set, and adjust on the fly.For safety, the remote input automatically overrides the manual input from your child, with one exception, and that is steering. If your child is strong enough, they can fight the resistance of the steering motor and point the vehicle where they want... Not good. The remote has a \"P\" button. Park? Power? Not sure really, but what the P button does is kill power to the drive motors. The vehicle will immediately stop and won't budge while you are holding that button, no matter what your child is doing. In running the grandson around today, not once did we feel unsure about the control of the vehicle.The radio is something else! Not sure if we have a loose wire, but the radio wouldn't pull in any local stations. Ill have to look into that, but we paired a cell phone to the vehicle bluetooth radio and had Disney hits playing from Spotify through the vehicle speaker while the grandson was being driven around! The cellphone was tossed under the hood and he was golden.The spring suspension is legit, you can see it working over harsh bumps and dips.Battery and charging -Battery life was about 35-40 minutes of constant remote control driving for this first time out. The majority of that time was on grass, with many long asphalt driveway runs. Overall I can't complain, it ran very well over grass and on the asphalt it got up to the 3mph or so it is rated for.  As I stated already, we remove the battery for charging.The charger seems to be \"smart\" in that the charger has a LED on it, its red when the battery is charging, and turns green when its supposed to be full.The battery is a 12v sealed lead acid \"6FM7\" 7AH battery. Readily available on Amazon if you need a new one. Per the instructions, the first time, I left the battery on the charger for 12 hours, even though the light on the charger went green after about an hour or so. I assume it will trickle charge.After running the battery down, I put the battery on the charger expecting it to take some 8 hours to charge, yet charger went green some 2 hours after putting it on. We haven't tested it yet to see the runtime, but Ill update how quick the turnover can be.Other thoughts -If you pop on over to Youtube and search for this ride on, you will get a lot of videos about 24v conversions, motor upgrades, and whatnot. Interesting to see what options you have in the future, and parts are pretty cheap on Amazon.Storage -We bought the kids ride on cover, and its great. https://smile.amazon.com/dp/B08GKC5N2T Fits perfectly.The \"Didnt know that\" tip -When you need to move the car, dead battery, or just in general, there is actually a pull out handle at the rear. Just under the rear bumper, in the center, reach in there and grab the handle. Pull it straight out, and you can now lift the rear of the vehicle and free-wheel it where you need to... You are welcome.\n\nI hope this review will help anyone who was one the fence like I was after reading some of the other reviews. I cannot speak to those who received broken/missing parts or the company’s customer service as I did not need to contact them. I can only comment on the vehicle itself.I bought this as birthday gift (2 years) for my Daughter. Out of the box I would give this thing a 3.5 star rating, but after a few fairly simple modifications I would live it a solid 4+ stars. It came 2 days ahead of Amazon’s expected delivery date. It came in a large box with minimal padding, but my unit arrived in perfect condition. However, I could see that if a courier was rough on this package it may not fare so well. Assembly took roughly 30 minutes (wasn’t rushing), and was simple if you follow the video on this amazon listing.Let me start off with some of the positives. The biggest of which is the parental remote. This was the main reason I went with this product over the Power Wheels brand. Since I knew child was still a little young to completely master this toy immediately, the parental remote was perfect. It allows me to keep her from running into things, and to stop her completely if needed. Pairing the remote was easy following the instruction on the back of the remote. In addition to the remote, the radio/sound effects, horn, and lights really makes this fun for my daughter. I even loaded a micro SD card with the sound track to her favorite movie (Trolls), and popped it into the radio. She absolutely loves being able to “blast” her favorite tunes in her ride. While others have complained about this jeep being sluggish when it starts, I actually believe this to be by design. For my young daughter I consider it to be a “pro”, as she doesn’t get that whiplash effect when she hits the gas. The “soft start” feature also keeps the motors from pulling a lot of amps right off the bat which would be hard on the electronics and battery in this toy.There were some general observations that could be considered a pro or con depending on how you look at it. This Jeep has larger wheels than some of it competitors. They are more rubber like grip instead of the hard plastic some other have. While this will give the stock vehicle a very reasonable top end speed, it does demand more torque to turn over the motors. This means that the vehicle has less ability to climb inclines or muscle through thick grass with a heavy rider. As I imagine the majority of kids will be using this in an urban jungle environment I don’t for see it being a huge issue, but keep in mind it will have more limitations than its real life counterpart. The added electronic components in this vehicle will make certain popular mods (higher draw motors or higher voltage systems) more difficult with this vehicle compared to the Power Wheels brand vehicles.  Also, Jeep this is only designed to seat one child. Pro or con…you decide.Lastly, let me share some things I see as negatives.  First, all the added features, while great, create additional points potential failure. If/when these things go they may mean additional headaches/heart aches. Second, is the fact that the only way to change between the three speeds is through the parental remote. Personally I would have preferred a selector switch one the side of the electronic controller under the hood. Right now having it on the remote is fine, but as she masters the vehicle and the need for me to have the remote goes away, it will be frustrating to have to change the speeds from the remote. The other big negative is the charging system, which is why I think a lot of people have complained about the battery not working after a couple of months. The included a 12V “wall wart” power supply as a charger for the battery. It plugs into the dash, but if you look at the wiring under the hood it directly feeds the battery. There is no logic circuit to control the charging of the battery. This is not the proper way to charge a Sealed Lead Acid (SLA) battery, and is most likely why other buyers are having their batteries fail prematurely. However, I will address this issue in just a moment.So before I go any further I should mention that there are warning stickers specifically stating not to modify the vehicles electrical system as it pose fire and other safety hazards. I’m sure it also voids any warranty the company may or may not otherwise honor. THE FOLLOWING NOTES ARE FOR INFORMATIONAL PURPOSES ONLY! IF YOU MAKE ANY MODIFICATIONS, YOU DO SO AT YOUR OWN RISK! That said I have a fairly solid understanding of electrical systems, and there were a couple fairly simple modifications that I made to this Jeep right away to address some issues with the batteries and charging systems. First, I took out the included 7Ah SLA battery that came with the vehicle, and replaced it with 2 - 9Ah SLA batteries available as set here on Amazon (\nExpertPower EXP1290-2 Black Replacement Battery (BX1300LCD, 2 x ExpertPower 12V 9Ah Sealed Lead Acid Batteries || EXP1290, APC BACK-UPS 1300VA)\n). The Jeep already has a space for a second battery. I just used a small piece of aluminum stock to make a brace for it similar to the one provided for the first battery. I also had to make a harness so the two batteries could be wired in parallel. While this will add a small amount of weight it should double the run time of the vehicle. In addition, it will also share the load between the two batteries which should benefit the SLA batteries in terms of longevity. The next thing I did was to add a battery indicator available here on amazon (\nIZTOSS Car Motorcycle Waterproof Blue LED Digital Panel Display Voltmeter Voltage Volt Meter Gauge DC 12V-24V\n). This will allow me to monitor the battery level to ensure that it does not go too low (I’m using 11V as my lower limit). I tapped into the wires that power the radio and “cluster” lights. This way the gauge does not say on when the vehicle is powered off.  Lastly, I purchased a charger that is designed for lead acid batteries. The one I am using is the Energizer ENC4A (\nEnergizer ENC4A 4 Amp Battery Charger with LCD + Maintainer 6/12V - 9 Step Smart Charging technology will improve your battery's life cycle for Car, RV & Boat\n) because I liked the digital readout. This kind of charger will ensure that the batteries are charged properly which should significantly help their longevity. I made an adapter for mine, but the same charger could have used the supplied “alligator” clips to connect to stock battery requiring no modification of the toy’s original wiring.In summary, I think that this very good ride-on toy for the cost. Out of the box it comes with a bunch of features that in my opinion make it a more attractive choice than some of the other options out there. It does have some shortcomings which are to be expected of something at this price point. The biggest issue, the battery management, can be rectified with more appropriate charger. Overall, this brought a huge smile to my daughter’s face, while keeping Mommy and Daddy happy knowing we had control when needed.  I hope this helped, best of luck!\n\nOkay so this was a Christmas gift for my daughter. She wanted a Jeep like mommy’s for Christmas. I found this one online and it looked like it had all the bells and whistles.It arrived in 2 huge boxes and looked extensive to assemble it. My husband tackled it and got it together okay all on Christmas Eve. I’d say give yourself 2 hours, if you’re good at this stuff. I would have needed considerably longer - like maybe a week (haha). It was and is my daughter’s favorite Santa present. She loves driving around on it and playing the music. She had no trouble operating it and loves the storage. Her little sister can ride with her comfortably. It comes with a remote, which we have not tried out yet.We had issues out the gate with power and charging. The battery would not hold a charge. My husband had to replace the battery and it’s working okay so far. I was really worried because I thought we would just be out the money. But the seller covered the cost of the battery replacement, which was wonderful!The third party seller system is a bit intimidating, and honestly I didn’t like it at all, but I’m learning. I was honestly afraid there would not be any options for refund or return. But the Amazon customer service agents helped me figure things out and messaged the seller on my behalf. The seller responded quickly and resolved our issue!Honestly, my husband and I thought it would have a little more speed and power than it does, especially for the price point. It’s best suited for flat riding. It struggles with hills. Our yard is mostly flat so it’s not a big issue for us. It looks really nice tooUpdate: So after one month of use, plastic parts are not holding up - mostly cosmetic right now thank goodness - fenders kept popping off so now we just leave them off as they won’t stay on. Bumper popped off but is currently hanging on. Front light is popping off. Back light bar is loose. All hard plastic parts, but they pop out and won’t stay in place well. Fingers crossed this thing stays drivable, because my daughter loves it - she’s still driving it almost daily!Update: not holding up over time - all the plastic parts are breaking. Next time I’ll stick with a name brand. She’s loving every minute she’s getting though. Way too expensive to already be breaking with one month of use.\n\nCan't wait to give this to my son for Christmas! I gave 4 stars only because we put it together and tested it, but aren't sure of it's longevity yet. Directions had a few hiccups that weren't thoroughly explained but definitely not so bad to figure out. Only took about 40 minutes.  Came charged and seems very sturdy. A lot of metal framing, and not cheap feeling. I thought I was getting a smaller toddler sized version for the price I paid, but it's pretty big and the price was great.\n\nThe media could not be loaded.\n                \n\n\n\n I bought this for my daughters second birthday, so far we’ve used it multiple times and she absolutely loves it! The remote that comes with it is also very easy to use! The only issue I’d say is that it dies pretty fast after riding it for maybe an hour or two, to me that’s fine for now because it’s hot as ever outside lol but in the future just gonna get a better stronger one and it’ll be fine.. I’d say worth the price!! It was a little complicated putting it together but figured it out in the end.. if you’re looking for your kids first big toy this is a win in my books 🎯\n\nWe've had ours for a few years now and our daughter loves it. Very easy to assemble, has a radio and headlights (back rack lights are just decorative). However, don't even bother trying to use this if you don't upgrade the battery and charger. Other reviews say as much and they are 100% right. With the battery it comes with and wall charger you'll be lucky to make it 30ft through the grass, less if you're going up any incline. Absolutely terrible and your kid will be upset that it's dead already.Buy these items and your kids jeep will run for hours even though wet grass:Energizer 4-Amp Battery Charger/Maintainer, 9-Step Smart Battery Car Charger with LCD Display, 6V/12V Auto Voltage Detection, Charger for Car, Motorcycle, RV, Boat, SUVExpertPower 12 Volt 12 Ah Rechargeable Battery with F2 Terminals || EXP12120It's very easy to do. Hardest part was taking the black cable off of the original battery because they silicone it down. There is no wiring, or cutting wires, or needing any electrical background. The battery fits perfect in the jeep, and the charger ensures it is being charged correctly. The wall wart that comes with this is not the optimal way to charge a battery. Other reviews go into more detail, but trust me when I say it's a night and day difference. My friend bought one of these and was amazed how much more my daughter could use hers vs his son. He made the switch as well. Not even kidding when I say I went on an hour walk with her driving, some very steep hills, drove around a parking lot for another half hour at least, and drove back home another 10min. She still had enough battery to drive around our inclined backyard the next day.The remote control for the parent to use is awesome as well. Keeps your kid safe, and if they're too young to drive themselves you can take them on a ride like a remote control car. More importantly you can stop your kid from driving into the streets if they're not paying attention.\n\nWe followed instructions, charged  it for 12 hours before initial use. It  became unresponsive 3 times on a first day. Completely frozen. It had electricity, but it completely froze unresponsive. Remote was going crazy blinking up and down,  which makes me suspicious the issue was due to the remote. We'll test again, if it malfunctions like that again, we will be returning jeep'a and asking for a refund. This is really big disappointment as it was a birthday gift for my baby daughter.Update: we were able to confirm that the issue is with the remote, not the jeep. So, I'm actually upgrading my feedback up to 4 stars now. Jeep runs great. No issues. To my surprise, it actually climbs ver well steep drive-ups. Battery lasts well so far, but again I follow instructions to the last letter. We've decided to keep it as it turns out to be a lot of fun for our daughter.\n\nLiked value for the money\n\nThis has worked great except a few months after using lightly…the battery now has major issues. It will die with no reason fully charged. Then it starts back after awhile. We have tried to find a new battery and buyer beware it’s not easy and expensive. Overall totally satisfied if it would just run.\n\nWe got this for our nephew's 2nd birthday. We decided on this one because of the remote control for it so our nephew doesn't have to know right away how to drive it to enjoy it. The built in music options sound a little cheap like they were homemade but with the additional options for a SD card or aux cable to play other music makes up for it.The assembly was ok. I was expecting it to come assembled because I didn't see it say otherwise (I could've missed that in the listing). My brother said the instructions were ok but could've been better, but good enough that he was able to get it assembled with only having to switch one piece around.No idea on battery life right now. Nephew's birthday isn't for a couple of weeks still.On confusing thing was the seller shipped the wheels separately from the rest of it, using two different carriers (UPS and FedEx) which made it confusing because we didn't know that it would ship in two separate boxes. I still consider this a risky move, what if the box with the wheels got lost? And couldn't get replacement before the birthday? Sets up a potential gift disaster, but luckily it worked out this time. This is the only reason I didn't give 5 stars, at the very least it should've been communicated that it would ship in two boxes.Update: Found a card with a $30 rebate inside the packaging, the seller refuses to honor it and has ignored my repeated emails. Further the rebate is on the condition that you post a review and not mention the rebate. Well they're not honoring it anyway so just a heads up.\n\nThis was pretty hard to put together for what it is. But it does go pretty fast for a toddler toy.  Also to note, it goes much better on sidewalk than it does in grass.\n\nThis thing is pretty cool. Only downside is it is much slower and struggles in the grass and on even small inclines.\n\nOnce we started looking at power ride on cars, I knew I had to get one with working doors and a radio/noise maker. This one had that and the parental remote control, so it was the winner. The kid (2 years) could spend all day on this: open door, climb in, close door, start engine, turn off engine, open other door, climb out, close door, run around to first door. He isn't really ready for driving or steering yet, but it'll come soon! I'm glad for the parental control, I can drive him around a little, or help him when he is testing out his driving skills. The doors latch with magnets, which I think is much better and likely to last longer than many of the others we looked at (plastic on plastic latches). It takes a lot of effort for the kid to open the door, which I think is a good thing!  He likes that the lights turn on and the radio and horn work. I wish it had a little more power -- or more grip on the wheels. It can hardly drive on our gravel road, or if the grass needs mowed, or if there's a tiny incline. I haven't taken it all the way to pavement to see how it works there, but seems like it would be better on that. Assembly wasn't too bad, maybe 45 minutes to an hour with one person.EDITED TO ADD -- 2 years later --In the two years that we've had this truck, we have had to replace the battery once (the original battery quit holding a charge before the first year was up), replace both 'drive engines' on the two rear wheels (thank goodness grandpa is an engineer!), and we've superglued the rubber grip pieces to the plastic tires because they kept slipping off. I feel like that's a lot of work to put into a toy car, but I guess it teaches the lesson that cars are frequently in the shop! The battery and the grip pieces didn't seem like major issues, but it was pretty scary when white smoke started pouring out from under the back side of the truck! Replacing those parts was beyond my ability, but we got it done, and thank goodness, because even 2 years out my kid still loves this and would like to use it daily.\n\nNot staying charged for that long\n\nI have 5 children. We have bought a lot of ride ons. This is by far my favorite. The speed, power and battery life are great. He drives it on the drive way and through the grass without a problem. The remote control, radio and lights are fun features that work well. I like the storage under the front hood. It's a great place to keep the remote and charging cable. It's also a fun place for him to haul whatever he brings along. The readout showing the battery voltage gives us a good idea of how much longer he can play before charging.My ONLY negative for this is the front axle. It is held in by two metal plates with four screws in each plate. They screw into PLASTIC. Over time these holes ream out and the screws fall out causing the axle to come loose. We have Macgyver'ed a solution, but it was a pain. I wish there was a metal bracket that it screwed into to keep it more secure. That's my only complaint. Overall, it's great!\n\nEverything is great except if you don't receive both boxes at the same time (happens a lot I guess if the product box already has a printed note about missing/late boxes) your left trying to hide the elephant in the room.  Make sure you have both before gift giving or it's half a car.\n\nI will update in a month after giving it a fair trial. For now I gave 4 stars until further notice. The packaging was great, the product in good condition and every thing was accounted for. I began assembling by myself at 8:40 expecting it to take 2 hrs and finished at 10:04. This is my first time assembling a large toy. Manual was super easy to fallow and all the holes aligned well. Only need a screw driver. Charging it over night and suprising my son with it tomorrow. Cant wait to see how it does. Oh also not mentioned on here I discovered a plastic pc in center front under seat that I believe can be used for a 5 point harness and in back of seat two holes that could be to attach a 5 point harness strap. Which I do plan to buy for my 22 month old and if it works  out for the plan as it appears it should I'll have pictures of it during my update. I just wish the bar lights and other 2 front search lights? Worked.\n\nFirst let me start off by saying why I gave it 4 stars instead of 5.. it comes in 2 different boxes and I didn’t get them at the same time. I got them 2 days apart but wasn’t a huge deal just a little irritating. I just got my second box today and put it all together. Was super easy to assemble. The remote so far works great and everything works as it should. I wish the light bar behind the seat worked but can’t have it all lol. The BT radio works good, the speaker is a little quiet while it is in motion and there is a slot for another speaker so idk why they don’t just put 2 speakers in there. Anyway overall so far it’s been great!\n\n",
        "I can’t say enough great things about this. After about two serious of seriously heavy use, the battery is going out. Instead of easily wiring a new one in i May just buy a new one so it’s fresh. We tricked ours out with a few cosmetic upgrades and easily wired in a second battery. With both batteries plugged in, we have drove this thing on heavy, muddy trails for about 2.5 miles and 6 hours of continuous use and it KEPT going. Even made it through a little stream! The remote is a very long range (tested at about 150ft in wide open grass) and connection was solid. I like how the remote has 3 speeds and an easy stop button. This will have an issue with going up somewhat steep hills in which it’ll just shut off so be mindful of that. I’ve even attached a 40lb wagon to the back that carried some supplies for our hike and it was great. My wife sometimes sits inside with our child and it will go uphills and everything. Seriously an awesome little Jeep. Grass? No problem, just use it on the 2-3 speed setting. There are two minor issues with this thing though and they are 1)it takes a second to get going once you push the forward remote button and 2)while driving with the remote, the wheels don’t “reset” back to straight. They kinda stay where you last set the turn and, even then, if you hold L or R on the remote, it kinda loses that direction after a second and you have to press it again. It’s hard to explain but it can be a big issue if you’re driving it on, say, a sidewalk and need to make a turn in which it will lose your direction and go “straight”. Another tiny nuisance i that the radio is a bit hard to navigate (there are instructions online). And note that the only lights that toggle are the two big headlights and the two back red “brake” lights. Other than those issues, it’s great.\n\nJeep comes in two packages. Thankfully didn't try to assemble right away because we got the second box days later.Jeep was easier to assemble with two, remote works relatively well. The clasp to hold the hood down (what’s pictured) was received broken but they included two extras.My only note is that there is no gradual stop. When not pushing the petal down the jeeps back wheels stop moving fast and somewhat jolt the jeep to an abrupt stop. Stopping so rough my poor kids neck.However, I am happy with our purchase and would recommend\n\nBought this for my son and he loves it. Battery lasts about 2 hours and the controller works really good. It does disconnect from time to time which is a little aggravating. It also stops really quick throwing the child forward a bit. Also the Jeep comes in 1 day and the tires come the next so don’t try to assemble until you get 2 different boxes.\n\nMy daughter loved the first jeep they sent however while building it. The latches were broken to close the hood down. They kept breaking even the extra pair they came with. It does well in the snow and we cant wait to use it in spring. It does requires 12hr of battery charging before using it so it dont mess up the battery. This jeep should he carried by two people not one because it will break. The front bumper grill broke when I picked it up on my own. They did send a replacement and let us keep the first one. However, I think the plastic they use could be sturdier as it is an outdoor toy.\n\nWe like what we have just it needed a better seat belt and if possible a helmet for the kid.\n\nGreat keep so far except bluetooth was a bit challenging to get start up at first. Grandson is very happy\n\nInitial Revieiw:We’ve only had this for a day and I have to say my 2 year old loves it. The assembly was quick and easy. The remote function was an absolute necessity for us and is a great feature. Overall the Jeep looks really sharp too.For the price point, it’s the best value I could find. A couple of items so far of constructive feedback:The remote control isn’t the best as far as controlling the Jeep. It definitely suffices but when turning the vehicle the direction resets after a few seconds so it will turn and then go forward and you have to depress the turn direction again every couple of seconds. A joystick control would be awesome, but I realize this feature may not be as important to parents with older kids. The override function is great though, keeps the kids safer.We have a gradually/slightly sloped yard and it definitely struggles to get up. It would be awesome if it had a bit more torque.Lastly, my daughter has turned the Jeep off several times but once in the middle of the road (I was really close behind) but I can see this being a potential safety hazard. It’d be nice if the remote could override the power switch.Overall, so far we love it. Would recommend, definitely at this price. I hope it lasts long-term. I will update this post if anything else arises.\n\nKiddo loves this jeep . Fairly easy to assemble. Battery life honestly surprised me when it’s fully charged. Get a full 90minutes without noticeable decline in power. Then about 30min of power with noticeable and quick decline. Headlights are bright but the roof rack lights are just decoration. Radio works good also. Now for the aggravating. There’s a button on the steering wheel that changes the radio station. And for the age group this product targets they can’t help but hit that button and then get mad when their favorite music changes. While the battery does last awhile and the car is decently quick, it also does ok on medium length grass. It doesn’t do well even on small hills in the grass. It will go up for about 20-30 feet then it all turns off. Which tells me the overcurrent for amperage is set fairly low. But other than that it’s for sure a great purchase and I strongly recommend this product\n\nI have had this product for just about three months now, my son received it for his first birthday present. He absolutely loves it and demands to ride in it everyday! It is recommended for ages 3+ but my son has had no problem sitting in it while I drive him. It has one strap that goes across the lap (which is perfect for ages 3+ but my baby really needs should straps). It has the option for the kid to drive it or for the parent to drive it which I love. We live out in the country and we have had no problem driving this through grass, rocky roads, piles of dirt, through the fields, etc. You can play the radio and even sync it up with your phone or iPad which is awesome because my son loves music! We have two acres that we let him ride around and have not yet done out of distance from the remote on our two acres.The reason I only gave it four stars:The power button is displayed on the dash with a bright red button; this bright red button is so tempting to my LO who usually pushes it to turn it off right around the time he gets the farthest away from me. I wish there was a power button on the remote for instances like this so I won't have to walk out to him to turn it back on.  Also, the past week or so the remote has been glitching and not working -the foot petals still work though. We thought it just needed new batteries at first but we have changed the batteries several times and it still occasionally quirts working. We may have to end up calling the manufacturer about this because this is too expensive to just sit in the garage until baby is big enough to drive himself.\n\nLoads of fun for our granddaughter, just the right speed. She is three but tall for her age, hope she doesn't out grow it to soon.\n\n"
    ],
    "negatives": [
        "This is a great jeep and I love the remote control that parents can use.  It is not really big enough for a 6 year old that is tall, she uses it but her legs are uncomfortable!\n\nRuns great on the pavement, none on the grass. Battery dies too quickly, and already need a replacement.\n\nUpdated review:We received the machine missing components critical to operation - the front axle and all wheels.  After sending a message through Amazon which did not receive a response we reached out to Best Choice Products through their website.  The correct components were shipped out and received in a couple days.Once assembled the unit is definitely both feature rich but less solid than Power Wheels.  Every plastic component has a fair amount of play due to loose tolerances.  The front wheels are out of alignment with each other a couple degrees, but not enough to cause issues.  Battery life seems very poor with only one SLA battery that is not very large.The most confounding part of the battery battery design is that it is glued at several spots and is clearly not designed to be removed.  This means the battery cannot be removed for charging.  Instead you must pull the dead machine close to a charging outlet.There are parts of this our son loves over his sister's Power Wheels.  Both children absolutely cannot get enough of the radio.  The overall appearance of the unit is quite nice.The battery life seems very poor but the LED lights and radio do not help the matter.  There is a second spot that looks designed to have a second battery installed.  With some minor electrical work it may be possible to drop in a second battery but we have not confirmed as the control board for the unit does not look to be designed for this.  Maybe there is another model where this is in place?The seat belt is useful with an unruly child.  Our Power Wheels Frozen keep lacks this feature.The remote is ok and the primary reason we purchased this unit.  Our son loves to go hands free and has intentionally slammed into a tree once.  The remote works but is sporadic on turning.  Holding down the turning buttons seems to lose communication after a second or so.  Perhaps our battery was dying or out of rangeThe machine itself seems sturdy.  The shock absorption items  are interesting.  However the shocks seem to do little as the springs are very stiff.  This may loosen up over time.Original review:We received this unit and upon opening box began assembly.  The unit was well packaged overall but was missing some key components:All wheelsFront axleAxle frameI'm not certain how these get missed but it is a sign of poor quality control.  I have reached out to the seller to remedy this.  I will updated the review once I have received the components.\n\nThe jeep appears to be well made with the exception of the hub caps falling off all the timeIt is fairly small in size in comparison to vehicles that we have purchased in the pastWe bought it for a 5 year oldIt is really better for a smaller child\n\nVery cool truck especially since my grandson is literally too young to drive.  We know he’ll grow into it and learn to use the gas petal and steer on his own.  However, right now it’s great to have a remote so he still gets the thrill of driving in a Jeep (I’m sure other models are available). What we didn’t like was that it was delivered without the hardware (not sure if was a return or what.  It was right before his birthday party so my handy son used his own bolts and screws to put it together.  The Bluetooth speaker is a very cool feature.  Not sure if it is all the Jeeps or just ours but there was only one speaker even though the design has two speakers. It looked like there should’ve been two. Very cool to play music while in the car but as you can imagine not the best quality speaker.  Both headlights light up which is also a very cool feature.\n\nI was hesitant to buy a ride on toy because my fear was we would be far from home and it would stop working and then im having to push this thing with my toddler inside while carrying my 3 month old..I'm sure with the amount of stars accompanying this review you know what happened next.I was sold on the parent remote that this comes with, thinking I could over power a stubborn toddler and drive it home when I knew it would need a charge so we wouldn't get stuck. We'll 15 houses down from ours, the car just completely stopped moving. It had power and a full charge. The music was playing, lights on, but wheels not turning. The parent remote just blinked showing it wasn't able to connect to the jeep so we were completely immobile. Turning the car off, disconnecting batteries etc did nothing.  Pushed the car 10 houses, then tried again...nothing. finally got this thing in the driveway and it decided to move again like nothing happened.  I live on a flat street, no hills and all sidewalks.  Disappointing. This happened again on rides 2 and 3, no reason that I can tell. Frustrating considering the price and many 5 star reviews. Wish I had one of their experiences. The jeep does look nice and the radio is fun, but not reliable if you have other young kids to carry.\n\nRear axle detached after several months, it appears the welding quality is very low and one of the pins holding the axle in place fell of (see attached pictures). The car is unusable after several months. I paid $300 for it (it is regularly on sale and no point in buying for $300).Customer service non-existent, they offer no support after 60 days from the purchase and essentially say \"should have got an insurance\". They have no replacement parts.Overall, the car is cheaply made, it looks nice, but the looks are deceptive, everything is made with low quality materials to cut costs and the whole structure is rather flimsy. When it drives on a bumpy road, it rattles like a can of trash. Plastic wheels wear out  quickly. Suspension is useless, the springs are too tough and they dont make any difference, it is the same as if there was no suspension (other reviewers noted the same thing). It requires a lot of space for turning.It took about 1 hour to put it together, it was not difficult.They falsely claim that the batter lasts two hours. In reality, it lasts about 10-15 minutes, i bought a second battery right away, so sometimes we get 20-30 minutes of riding out of one charge.The remote works fine. the gas pedal in the car is on/off, not a regulator, but when the pedal is pressed on, the power increases gradually so the car has a smooth start.\n\nMy daughter has enjoyed this for a few years. The steering wheel motor broke from its mounting location an there was no part available or any suggestions from seller on how to repair. I was able to use to metal straping and hold it in place. And recently the board under the hood in battery compartment started to smoke an and the Jeep will no longer drive. Turns on an lights turn on. Radio is dead an again will not move. No direct replacement parts from seller so I have to guess as to which parts on Amazon may work to get this thing mobile again. I'd advise to not purchase this because of this issue I had. Mainly because you'll have no help resolving the issue\n\nThe car has already been used.  Unfortunately, I didn't put it together and couldn't notice it in time. Let's see how long it lasts.\n\n****UPDATE****:  I did some power tracing using a multi- meter I found it was a loose wire on the control module and I fixed it myself. BCP  offered a 20% partial refund to keep the now working car. So changing from 1 star to 3 stars for the quick response. So if you have issues, trace all wiring that leads back to the module under/behind the dash board.  [Original Comments: Tech support phone line was not much help. Just read the troubleshooting guide that was in the manual, which I already did. There is some bad wiring in there somewhere. I am former military electronic technician. So I am not stupid, an assembled and charged exactly per instructions. Of the two cars ordered, one car turned right on, the other was DEAD on arrival.  Any replacement will miss Christmas because Customer Support said they would not rush a replacement, so my daughter will be very sad on Christmas morning, she asked “Santa” for this a month ago.  My son's own works fine. So, I guess it is hit or miss when you order. They DO NOT QC them before they ship. So you might get lucky an get a good one Also, one of the hood latches was broken upon arrival. ]\n\nThis is a very good product for its price but I did find a couple of things that I did not consider when I bought it and wanted to share for the other customers.- The acceleration/deceleration bump will make your kid shake. When you let go of the pedal or the remote control acceleration button, the car instantly stops running and causes your kid to go back and forth so make sure you put the seatbelt on.- The plastic wheels slide too easily on concrete or pavement so make sure you practice a little bit with the remote before letting your kid rid on it.- No suspension which propagates the bumps on the road directly to the driver.- The battery life is really good and it will allow you to go for a walk with your kid on the car. I've taken my kid on a good 30+ minutes walk and it came back home with problem but since there is no way to determine the charge on the battery, then make sure you fully charge it before going out.- The seat has no cushion so your kid will get tired of sitting on a hard seat sooner than later.Other than that, it's a good electric car for kids as a toy. It has good traction which will allow us to use it for a couple of years and pass it on to my second child. If I knew these things before I bought it, I would have probably spent a couple more bucks and get another model that takes care of them. I know there are other models that control the acceleration of the motors and make an easier and more enjoyable ride.\n\n"
    ]
}